Repository: itsfatduck/optimizerDuck
Catalog: optimizerDuck/Resources/Languages/Translations.*.resx
Languages: ru_ru, vi_vn, zh_hans

# Revert.Error.InvalidJsonFormat
source: Invalid JSON format: {0}
ru_ru: Недействительный формат JSON: {0}
vi_vn: Định dạng JSON không hợp lệ: {0}
zh_hans: JSON 格式无效：{0}

# Revert.Error.NoSteps
source: No revert steps found.
ru_ru: Шаги отката не найдены
vi_vn: Không có bước hoàn tác.
zh_hans: 未找到还原步骤

# Revert.Error.InvalidSteps
source: Invalid revert steps: {0}
ru_ru: Недействительные шаги отката: {0}
vi_vn: Các bước hoàn tác không hợp lệ: {0}
zh_hans: 还原步骤无效：{0}

# Revert.Error.OptimizationIdMismatch
source: OptimizationId mismatch.
ru_ru: Несоответствие ID оптимизации
vi_vn: OptimizationId không khớp.
zh_hans: 优化 ID 不匹配

# Service.Common.Error.AccessDenied
source: Access denied
ru_ru: Доступ запрещён
vi_vn: Không có quyền truy cập
zh_hans: 访问被拒绝

# Service.Registry.Error.AccessDeniedProtectedHive
source: Access denied (protected hive)
ru_ru: Доступ запрещён (защищённый раздел реестра)
vi_vn: Bị từ chối truy cập (registry được bảo vệ)
zh_hans: 访问被拒绝（受保护的注册表项）

# Service.Registry.Error.UnauthorizedAccess
source: Unauthorized access
ru_ru: Несанкционированный доступ
vi_vn: Không có quyền truy cập
zh_hans: 未授权访问

# Service.Registry.Error.CreateOrOpenSubkeyFailed
source: Failed to create/open subkey
ru_ru: Ошибка создания/открытия подраздела
vi_vn: Không thể tạo/mở khóa con (subkey)
zh_hans: 创建/打开子键失败

# Service.Service.Error.NotFound
source: Service not found
ru_ru: Служба не найдена
vi_vn: Không tìm thấy dịch vụ
zh_hans: 服务未找到

# Service.Service.Error.UpdateRegistryForStartupTypeFailed
source: Failed to update registry for startup type
ru_ru: Ошибка обновления реестра для типа запуска
vi_vn: Không thể cập nhật registry cho kiểu khởi động
zh_hans: 更新启动类型的注册表失败

# Service.Service.Error.ChangeStartModeFailedWithCode
source: ChangeStartMode failed (code: {0})
ru_ru: Ошибка ChangeStartMode (код: {0})
vi_vn: ChangeStartMode thất bại (mã: {0})
zh_hans: 更改启动模式失败（代码：{0}）

# Service.Shell.Error.ExitCode
source: Exit code {0}
ru_ru: Код выхода {0}
vi_vn: Mã thoát {0}
zh_hans: 退出代码 {0}

# Service.Shell.Error.TimedOut
source: Timed out
ru_ru: Таймаут
vi_vn: Hết thời gian chờ
zh_hans: 超时

# Dialog.AreYouSure.Title
source: Do you really want to proceed?
ru_ru: Вы уверены, что хотите продолжить?
vi_vn: Bạn có chắc chắn muốn tiếp tục không?
zh_hans: 您确定要继续吗？

# Settings.ClearResources.Description
source: You are about to delete all resources downloaded or generated during the optimization process. Please note that this action is permanent and cannot be undone, so make sure you are certain before proceeding.
ru_ru: Вы собираетесь удалить все ресурсы, загруженные или созданные в процессе оптимизации. Обратите внимание, что это действие необратимо, пожалуйста, убедитесь перед продолжением.
vi_vn: Bạn sắp xóa tất cả các tài nguyên đã được tải xuống hoặc tạo ra trong quá trình tối ưu. Xin lưu ý rằng hành động này là vĩnh viễn và không thể hoàn tác, vì vậy hãy chắc chắn trước khi tiếp tục.
zh_hans: 您即将删除优化过程中下载或生成的所有资源。请注意此操作不可撤销，请确认后再继续。

# Settings.ClearRevertData.Description
source: You are about to delete all rollback data generated after the optimization process. This means you will no longer be able to restore the pre-optimization state, so please think carefully before confirming.
ru_ru: Вы собираетесь удалить все данные отката, созданные после процесса оптимизации. Это означает, что вы больше не сможете восстановить состояние до оптимизации, пожалуйста, внимательно рассмотрите перед подтверждением.
vi_vn: Bạn chuẩn bị xóa tất cả dữ liệu hoàn tác được tạo sau quá trình tối ưu. Việc này đồng nghĩa với việc bạn sẽ không thể khôi phục lại trạng thái trước tối ưu, vì vậy hãy cân nhắc thật kỹ trước khi xác nhận.
zh_hans: 您即将删除优化后生成的所有还原数据。这意味着您将无法恢复到优化前的状态，请仔细考虑后再确认。

# ProcessingOptimizationDialog.Warning.DontCloseAppOrRestart
source: Please don't close the app or restart while changes are being applied or reverted.
ru_ru: Пожалуйста, не закрывайте приложение и не перезагружайте компьютер во время применения или отката изменений.
vi_vn: Vui lòng không tắt ứng dụng hoặc tắt máy trong khi đang áp dụng hoặc hoàn tác các thay đổi hệ thống.
zh_hans: 在应用或还原更改时，请勿关闭应用或重启计算机。

# Optimization.Apply.Snackbar.Error.Title
source: Couldn't apply optimization.
ru_ru: Ошибка применения оптимизации
vi_vn: Đã xảy ra lỗi sau khi áp dụng.
zh_hans: 应用优化失败

# Optimization.Revert.Snackbar.Error.Title
source: Couldn't revert optimization
ru_ru: Ошибка отката оптимизации
vi_vn: Đã xảy ra lỗi sau khi hoàn tác
zh_hans: 还原优化失败

# Optimization.Toggle.Snackbar.Error.Title
source: Couldn't toggle optimization
ru_ru: Ошибка переключения оптимизации
vi_vn: Không thể áp dụng/hoàn tác tối ưu
zh_hans: 切换优化状态失败

# Optimization.Toggle.Snackbar.Error.Message
source: An error occurred: {0}
ru_ru: Произошла ошибка: {0}
vi_vn: Đã xảy ra lỗi: {0}
zh_hans: 发生错误：{0}

# Snackbar.OpenLinkFailed.Title
source: Unable to open the path
ru_ru: Не удалось открыть путь
vi_vn: Không thể mở đường dẫn
zh_hans: 无法打开路径

# Snackbar.OpenLinkFailed.Message
source: An error occurred while opening the path. Please check the log.
ru_ru: Ошибка при открытии пути, проверьте журнал.
vi_vn: Lỗi khi mở đường dẫn, bạn hãy kiểm tra log.
zh_hans: 打开路径时出错，请检查日志。

# Snackbar.OpenFailed.Title
source: Unable to open the folder or file
ru_ru: Не удалось открыть папку или файл
vi_vn: Không thể mở thư mục hoặc tệp
zh_hans: 无法打开文件夹或文件

# Snackbar.OpenFailed.Message
source: An error occurred while opening the folder or file. Please check the log.
ru_ru: Ошибка при открытии папки или файла, проверьте журнал.
vi_vn: Lỗi khi mở thư mục hoặc tệp, hãy thử kiểm tra log.
zh_hans: 打开文件夹或文件时出错，请检查日志。

# Common.Unknown
source: Unknown
ru_ru: Неизвестно
vi_vn: Không rõ
zh_hans: 未知

# Common.AppliedJustNow
source: Just applied
ru_ru: Только что применено
vi_vn: Vừa áp dụng
zh_hans: 刚刚应用

# Common.AppliedSecondsAgo
source: Applied on {0} seconds ago
ru_ru: Применено {0} сек. назад
vi_vn: Đã áp dụng {0} giây trước
zh_hans: {0} 秒前应用

# Common.AppliedMinutesAgo
source: Applied on {0} minutes ago
ru_ru: Применено {0} мин. назад
vi_vn: Đã áp dụng {0} phút trước
zh_hans: {0} 分钟前应用

# Common.AppliedHoursAgo
source: Applied on {0} hours ago
ru_ru: Применено {0} ч. назад
vi_vn: Đã áp dụng {0} giờ trước
zh_hans: {0} 小时前应用

# Common.AppliedDaysAgo
source: Applied on {0} days ago
ru_ru: Применено {0} дн. назад
vi_vn: Đã áp dụng {0} ngày trước
zh_hans: {0} 天前应用

# Common.AppliedMonthsAgo
source: Applied on {0} months ago
ru_ru: Применено {0} мес. назад
vi_vn: Đã áp dụng {0} tháng trước
zh_hans: {0} 个月前应用

# Common.AppliedYearsAgo
source: Applied on {0} years ago
ru_ru: Применено {0} г. назад
vi_vn: Đã áp dụng {0} năm trước
zh_hans: {0} 年前应用

# Dashboard.Header.Menu.Refresh
source: Refresh
ru_ru: Обновить
vi_vn: Làm mới
zh_hans: 刷新

# Dashboard.Header.Menu.Header.Options
source: Options
ru_ru: Параметры
vi_vn: Tùy chọn
zh_hans: 选项

# Dashboard.Header.Menu.Header.Run
source: Run
ru_ru: Запуск
vi_vn: Mở
zh_hans: 运行

# Dashboard.Header.Menu.RunSettings
source: Settings
ru_ru: Настройки
vi_vn: Cài đặt
zh_hans: 设置

# Dashboard.Header.Menu.RunTaskManager
source: Task Manager
ru_ru: Диспетчер задач
zh_hans: 任务管理器

# Dashboard.Header.Menu.RunControlPanel
source: Control Panel
ru_ru: Панель управления
zh_hans: 控制面板

# OptimizationResultDialog.Header
source: {0} Failed steps
ru_ru: {0} неудачных шагов
vi_vn: {0} Bước bị lỗi
zh_hans: {0} 个失败步骤

# OptimizationResultDialog.Description
source: Some steps didn't complete successfully. You can retry only the failed steps.
ru_ru: Некоторые шаги не были выполнены успешно. Вы можете повторить только неудавшиеся шаги.
vi_vn: Một số bước chưa hoàn tất thành công. Bạn có thể thử lại chỉ những bước bị lỗi.
zh_hans: 某些步骤未成功完成。您可以仅重试失败的步骤。

# RestorePoint.Title
source: System Restore
ru_ru: Восстановление системы
vi_vn: Phục hồi hệ thống
zh_hans: 系统还原

# RestorePointDialog.Description
source: The Windows operating system includes a feature called Restore Point, which allows you to revert the system to its previous state before applying any changes or optimizations.
ru_ru: <![CDATA[Точка восстановления позволяет вернуть систему в исходное состояние. Это важная мера безопасности перед применением оптимизаций.]]>
vi_vn: Restore Point giúp bạn đưa hệ thống trở về trạng thái trước khi thay đổi. Đây là cách an toàn nhất để bảo vệ máy tính của bạn khi tối ưu hóa.
zh_hans: <![CDATA[系统还原功能可让您在进行更改前将系统恢复到之前的状态。 这是在应用优化前保护系统的安全措施。]]>

# RestorePointDialog.Help
source: When you proceed, the application will automatically activate System Restore (if it is disabled) and create a new restore point with a name starting with "optimizerDuck...", helping safeguard the system before any changes.
ru_ru: <![CDATA[Приложение автоматически включит восстановление и создаст точку "optimizerDuck...". Это гарантирует возможность отката, если что-то пойдет не так.]]>
vi_vn: Ứng dụng sẽ tự động kích hoạt và tạo một điểm khôi phục mới mang tên "optimizerDuck...". Hãy yên tâm rằng hệ thống của bạn luôn có đường lui nếu có sự cố xảy ra.
zh_hans: <![CDATA[程序将自动开启系统还原并创建一个名为 "optimizerDuck..." 的还原点。 如果出现任何问题，您可以随时恢复系统。]]>

# RestorePoint.Progress.Creating
source: Creating a restore point...
ru_ru: Создание точки восстановления...
vi_vn: Đang tạo điểm khôi phục...
zh_hans: 正在创建还原点...

# RestorePoint.Progress.Enabling
source: Enabling System Restore...
ru_ru: Включение восстановления системы...
vi_vn: Đang mở System Restore...
zh_hans: 正在启用系统还原...

# RestorePoint.Progress.Retrying
source: Retrying to create the restore point...
ru_ru: Повторная попытка создания точки восстановления...
vi_vn: Đang thử tạo lại điểm khôi phục...
zh_hans: 正在重试创建还原点...

# RestorePoint.Snackbar.Success.Title
source: Restore point created successfully
ru_ru: Точка восстановления успешно создана
vi_vn: Tạo thành công điểm khôi phục
zh_hans: 还原点创建成功

# RestorePoint.Snackbar.Success.Message
source: A restore point has been created with the name: {0}.
ru_ru: Точка восстановления создана с именем: "{0}".
vi_vn: Điểm khôi phục đã được tạo với tên: {0}.
zh_hans: 已创建名为 "{0}" 的还原点。

# RestorePoint.Snackbar.Error.Title
source: Unable to create or enable System Restore.
ru_ru: Не удалось создать или включить восстановление системы
vi_vn: Không thể tạo hoặc bật System Restore
zh_hans: 无法创建或启用系统还原

# RestorePoint.Snackbar.Error.Message
source: An error occurred while creating or enabling System Restore. Please try creating it manually.
ru_ru: Ошибка при создании или включении восстановления системы, попробуйте создать вручную.
vi_vn: Lỗi khi tạo hoặc bật System Restore, bạn hãy thử tạo thủ công.
zh_hans: 创建或启用系统还原时出错，请尝试手动创建。

# BloatwareDialog.Title
source: Removing {0} AppX Package(s)
ru_ru: Удаление {0} пакетов AppX
vi_vn: Đang gỡ {0} Gói AppX
zh_hans: 正在移除 {0} 个 AppX 包

# BloatwareDialog.Removing
source: Removing {0} ({1}/{2})
ru_ru: Удаление {0} ({1}/{2})
vi_vn: Đang gỡ {0} ({1}/{2})
zh_hans: 正在移除 {0} ({1}/{2})

# Bloatware.Header.Title
source: Bloatware
ru_ru: Ненужные приложения
zh_hans: 臃肿软件

# Bloatware.Menu.Remove
source: Remove ({0})
ru_ru: Удалить ({0})
vi_vn: Gỡ ({0})
zh_hans: 移除 ({0})

# Bloatware.Menu.Refresh
source: Refresh
ru_ru: Обновить
vi_vn: Làm mới
zh_hans: 刷新

# Bloatware.Empty.Title
source: No unnecessary apps found
ru_ru: Ни одного приложения не найдено ¯\_(ツ)_/¯
vi_vn: Không tìm thấy bất kì một ứng dụng nào ¯\_(ツ)_/¯
zh_hans: 未找到任何应用程序 ¯\_(ツ)_/¯

# Bloatware.Empty.Description
source: optimizerDuck didn't find any removable AppX packages. Everything looks quite good.
ru_ru: optimizerDuck не нашел ни одного расширения AppX для удаления. Пусто, как в бесконечной пустоте...
vi_vn: optimizerDuck không tìm thấy gói AppX nào có thể xóa. mọi thứ trống không như hư vô...
zh_hans: optimizerDuck 未找到任何可卸载的 AppX 包。一切如虚空般空旷...

# Bloatware.Loading
source: Looking for removable apps…
ru_ru: Поиск удаляемых приложений…
vi_vn: Đang tìm kiếm ứng dụng có thể gỡ…
zh_hans: 正在搜索可移除的应用…

# Sidebar.Bloatware
source: Bloatware
ru_ru: Ненужные приложения
zh_hans: 臃肿软件

# BloatwareDialog.Confirmation.Title
source: Remove {0} App(s)?
ru_ru: Удалить {0} приложений?
vi_vn: Bạn có muốn xóa {0} ứng dụng?
zh_hans: 要移除 {0} 个应用吗？

# BloatwareDialog.Confirmation.Message
source: You are about to remove: {0}
ru_ru: Вы собираетесь удалить: {0}
vi_vn: Bạn chuẩn bị sẽ xóa: {0}
zh_hans: 您即将移除：{0}

# Settings.Bloatware.Header
source: Bloatware
ru_ru: Ненужные приложения
zh_hans: 臃肿软件

# Settings.Bloatware.RemoveProvisioned.Title
source: Also remove Provisioned packages
ru_ru: Удалять подготовленные пакеты
vi_vn: Xóa gói Provisioned
zh_hans: 移除已配置包

# Settings.Bloatware.RemoveProvisioned.Description
source: When removing installed AppX packages, also remove the corresponding Provisioned packages to prevent automatic reinstallation for new users.
ru_ru: При удалении установленных пакетов AppX также удалять соответствующие подготовленные пакеты, чтобы предотвратить автоматическую переустановку для новых пользователей.
vi_vn: Khi xóa gói AppX đã cài đặt, cũng xóa luôn các gói Provisioned tương ứng để ngăn tự động cài lại cho người dùng mới.
zh_hans: 移除已安装的 AppX 包时，同时移除对应的已配置包，以防止新用户时自动重新安装。

# OptimizationDetailsDialog.Other
source: Other
ru_ru: Прочее
vi_vn: Khác
zh_hans: 其他

# OptimizationDetailsDialog.Other.OpenRevertFile.Description
source: Open the folder and select the rollback data file for this optimization.
ru_ru: Открыть папку и выбрать файл данных отката для этой оптимизации
vi_vn: Mở thư mục và chọn tệp dữ liệu hoàn tác của tối ưu này.
zh_hans: 打开包含此优化恢复数据的原始 JSON 文件。

# OptimizationDetailsDialog.Risk
source: Risk
ru_ru: Уровень риска
vi_vn: Độ an toàn
zh_hans: 风险等级
