Repository: itsfatduck/optimizerDuck
Catalog: optimizerDuck/Resources/Languages/Translations.*.resx
Languages: ru_ru, vi_vn, zh_hans

# Dashboard.Header.Title
source: Dashboard
ru_ru: Панель управления
zh_hans: 仪表板

# Sidebar.Dashboard
source: Dashboard
ru_ru: Панель управления
zh_hans: 仪表板

# Sidebar.Settings
source: Settings
ru_ru: Настройки
vi_vn: Cài đặt
zh_hans: 设置

# Sidebar.Optimize
source: Optimize
ru_ru: Оптимизация
vi_vn: Tối ưu
zh_hans: 系统优化

# Button.Close
source: Close
ru_ru: Закрыть
vi_vn: Hủy
zh_hans: 关闭

# Button.Ok
source: OK
zh_hans: 确定

# Button.Cancel
source: Cancel
ru_ru: Отмена
vi_vn: Hủy
zh_hans: 取消

# Button.Retry
source: Retry
ru_ru: Повторить
vi_vn: Thử lại
zh_hans: 重试

# Button.Clear
source: Clear
ru_ru: Очистить
vi_vn: Xóa
zh_hans: 清除

# Button.Open
source: Open
ru_ru: Открыть
vi_vn: Mở
zh_hans: 打开

# Button.Skip
source: Skip
ru_ru: Пропустить
vi_vn: Bỏ qua
zh_hans: 跳过

# Button.ViewLatestRelease
source: View latest release
ru_ru: Посмотреть последний релиз
vi_vn: Xem bản phát hành mới nhất
zh_hans: 查看最新版本

# Dashboard.SystemInfo.Cpu.Cores
source: {0} Cores
ru_ru: {0} ядер
vi_vn: {0} Nhân
zh_hans: {0} 核心

# Dashboard.SystemInfo.Cpu.Threads
source: {0} Threads
ru_ru: {0} потоков
vi_vn: {0} Luồng
zh_hans: {0} 线程

# Dashboard.SystemInfo.Ram.Modules
source: {0} Module(s)
ru_ru: {0} модулей памяти
vi_vn: {0} thanh RAM
zh_hans: {0} 条内存

# Dashboard.SystemInfo.Ram.Used
source: {0} GB Used
ru_ru: Использовано {0} ГБ
vi_vn: {0} GB đã dùng
zh_hans: 已用 {0} GB

# Dashboard.SystemInfo.Ram.Available
source: {0} GB Available
ru_ru: Доступно {0} ГБ
vi_vn: {0} GB khả dụng
zh_hans: 可用 {0} GB

# Dashboard.SystemInfo.Storage.Header
source: Storage
ru_ru: Хранилище
vi_vn: Ổ cứng
zh_hans: 存储

# Dashboard.SystemInfo.Storage.System
source: SYSTEM
ru_ru: СИСТЕМНЫЙ
vi_vn: HỆ THỐNG
zh_hans: 系统盘

# Dashboard.SystemInfo.Storage.DiskInfo
source: {0} GB used of {1} GB ({2} GB free)
ru_ru: Использовано {0} ГБ из {1} ГБ (свободно {2} ГБ)
vi_vn: Đã dùng {0} GB trên tổng {1} GB (còn {2} GB trống)
zh_hans: 已用 {0} GB / 共 {1} GB (剩余 {2} GB)

# Dashboard.SystemInfo.Gpu.More
source: + {0} more GPU
ru_ru: + ещё {0} GPU
vi_vn: Còn {0} GPU khác
zh_hans: + {0} 个其他 GPU

# Dashboard.SystemInfo.Loading
source: Fetching System Information...
ru_ru: Получение информации о системе...
vi_vn: Đang lấy thông tin hệ thống...
zh_hans: 正在获取系统信息...

# Dashboard.Actions.Discord.Title
source: Discord Community
ru_ru: Сообщество Discord
vi_vn: Cộng Đồng Discord
zh_hans: Discord 社区

# Dashboard.Actions.Discord.Description
source: Join our Discord community to... get support or play games with me
ru_ru: Присоединяйтесь к нашему сообществу Discord для получения технической поддержки или обсуждений
vi_vn: Tham gia cộng đồng Discord của chúng tôi để... được hỗ trợ hoặc chơi game với tôi
zh_hans: 加入 Discord 社区获取技术支持或参与讨论

# Dashboard.Actions.GitHub.Title
source: GitHub Repository
ru_ru: Репозиторий GitHub
vi_vn: Mã nguồn trên GitHub
zh_hans: GitHub 仓库

# Dashboard.Actions.GitHub.Description
source: Explore, review, and contribute to my project through GitHub
ru_ru: Изучайте, проверяйте и вносите вклад в код на GitHub
vi_vn: Khám phá, theo dõi và đóng góp mã nguồn trực tiếp tại GitHub
zh_hans: 在 GitHub 上探索、审查并贡献代码

# Dashboard.Actions.SupportMe.Title
source: Support Me
ru_ru: Поддержать разработчика
vi_vn: Hỗ Trợ Tôi
zh_hans: 支持开发者

# Dashboard.Actions.SupportMe.Description
source: Support me and keep this project growing!
ru_ru: Поддержите развитие этого проекта
vi_vn: Star repo trên GitHub, chia sẻ với bạn bè, hoặc donate — mọi đóng góp đều giúp dự án phát triển!
zh_hans: 在 GitHub 上给项目加星、分享给朋友或捐赠——每一份支持都很重要！

# Settings.Header.Title
source: Settings
ru_ru: Настройки
vi_vn: Cài đặt
zh_hans: 设置

# Settings.Appearance.Header
source: Appearance
ru_ru: Внешний вид
vi_vn: Giao diện
zh_hans: 外观

# Settings.Appearance.LanguageSelector.Title
source: Language
ru_ru: Язык
vi_vn: Ngôn ngữ
zh_hans: 语言

# Settings.Appearance.LanguageSelector.Description
source: Choose your preferred language.
ru_ru: Выберите предпочитаемый язык интерфейса
vi_vn: Chọn ngôn ngữ bạn muốn.
zh_hans: 选择您偏好的界面语言

# Settings.Appearance.ThemeSelector.Title
source: Theme
ru_ru: Тема
vi_vn: Chủ đề
zh_hans: 主题

# Settings.Appearance.ThemeSelector.Description
source: Select your preferred theme for the app.
ru_ru: Выберите тему оформления приложения
vi_vn: Chọn giao diện bạn muốn sử dụng.
zh_hans: 选择应用界面主题

# Settings.Appearance.ThemeSelector.Light
source: Light
ru_ru: Светлая
vi_vn: Sáng
zh_hans: 浅色

# Settings.Appearance.ThemeSelector.Dark
source: Dark
ru_ru: Тёмная
vi_vn: Tối
zh_hans: 深色

# Settings.Appearance.ThemeSelector.HighContrast
source: High Contrast
ru_ru: Высокий контраст
vi_vn: Tương phản cao
zh_hans: 高对比度

# Settings.LanguageChanged.Title
source: Language change
ru_ru: Язык изменён
vi_vn: Thay đổi ngôn ngữ
zh_hans: 语言已更改

# Settings.LanguageChanged.Description
source: You need to restart the application to apply the new language.
ru_ru: Необходимо перезапустить приложение для применения новых языковых настроек
vi_vn: Bạn cần phải khởi động lại ứng dụng để áp dụng ngôn ngữ mới.
zh_hans: 您需要重启应用程序以应用新语言设置

# Settings.Optimize.Header
source: Optimize
ru_ru: Параметры оптимизации
vi_vn: Tối ưu
zh_hans: 优化选项

# Settings.Optimize.ShellTimeout.Title
source: Shell service timeout
ru_ru: Таймаут Shell-сервиса
vi_vn: Thời gian chờ dịch vụ shell
zh_hans: Shell 服务超时

# Settings.Optimize.ShellTimeout.Description
source: Timeout for each shell command execution (milliseconds).
ru_ru: Таймаут выполнения каждой команды Shell (в миллисекундах)
vi_vn: Thời gian chờ cho mỗi lệnh shell (tính bằng mili‑giây).
zh_hans: 每个 Shell 命令执行的超时时间（毫秒）

# Settings.Optimize.ShellTimeout.Warning
source: Do NOT change unless you know exactly what you are doing
ru_ru: Не изменяйте, если точно не знаете, что делаете
vi_vn: ĐỪNG thay đổi trừ khi bạn biết chính xác mình đang làm gì
zh_hans: 请勿修改，除非您确切了解其作用

# Settings.Advanced.Header
source: Advanced
ru_ru: Расширенные
vi_vn: Nâng cao
zh_hans: 高级

# Settings.Advanced.ClearResources.Title
source: Clear resources
ru_ru: Очистить ресурсы
vi_vn: Dọn dẹp tài nguyên
zh_hans: 清除资源文件

# Settings.Advanced.ClearResources.Description
source: Delete all files downloaded during the optimization process.
ru_ru: Удалить все файлы, загруженные в процессе оптимизации
vi_vn: Xóa tất cả tệp đã tải về trong quá trình tối ưu.
zh_hans: 删除优化过程中下载的所有文件

# Settings.Advanced.ClearRevertDatas.Title
source: Clear all revert data
ru_ru: Очистить все данные отката
vi_vn: Xóa toàn bộ dữ liệu hoàn tác
zh_hans: 清除所有还原数据

# Settings.Advanced.ClearRevertDatas.Description
source: Clear all rollback data from optimizations.
ru_ru: Удалить все данные отката от оптимизаций
vi_vn: Xóa toàn bộ các dữ liệu hoàn tác của các tối ưu.
zh_hans: 清除所有优化产生的还原数据

# Settings.Advanced.OpenRootDir.Title
source: Open root directory
ru_ru: Открыть корневую директорию
vi_vn: Mở thư mục root
zh_hans: 打开根目录

# Settings.Advanced.OpenRootDir.Description
source: Open the application's root directory, where all necessary files are stored.
ru_ru: Открыть корневую директорию приложения, содержащую все необходимые файлы
vi_vn: Mở thư mục gốc của ứng dụng, nơi chứa tất cả các tệp cần thiết.
zh_hans: 打开应用程序根目录，包含所有必要文件

# Settings.About.Header
source: About
ru_ru: О программе
vi_vn: Giới thiệu
zh_hans: 关于

# Settings.About.Duck.Description
source: <![CDATA[Thank you for your trust and support <3! Current version: {0}]]>
ru_ru: <![CDATA[Спасибо за ваше доверие и поддержку <3! Текущая версия: {0}]]>
vi_vn: Cảm ơn bạn đã tin tưởng và ủng hộ <3! Phiên bản hiện tại: {0}
zh_hans: <![CDATA[感谢您的信任与支持 <3！ 当前版本：{0}]]>

# Settings.About.LearnMore
source: Learn more
ru_ru: Узнать больше
vi_vn: Tìm hiểu thêm
zh_hans: 了解更多

# Settings.About.LearnMore.Documentation
source: Documentation
ru_ru: Документация
vi_vn: Tài liệu hướng dẫn
zh_hans: 文档

# Settings.About.LearnMore.Support
source: Support me
ru_ru: Поддержать разработчика
vi_vn: Star & Hỗ trợ tôi
zh_hans: Star 与支持

# Settings.About.LearnMore.Discord
source: Discord community
ru_ru: Сообщество Discord
vi_vn: Cộng đồng Discord
zh_hans: Discord 社区

# Settings.About.LearnMore.GitHub
source: GitHub repository
ru_ru: Репозиторий GitHub
vi_vn: Mã nguồn trên GitHub
zh_hans: GitHub 仓库

# Settings.About.Acknowledgements.Title
source: Acknowledgments
ru_ru: Благодарности
vi_vn: Ghi nhận đóng góp
zh_hans: 致谢

# Settings.About.Acknowledgements.Description
source: optimizerDuck is made possible by the following open-source software and resources.
ru_ru: optimizerDuck стал возможен благодаря следующему программному обеспечению с открытым исходным кодом
vi_vn: optimizerDuck được xây dựng nhờ các phần mềm và tài nguyên nguồn mở.
zh_hans: optimizerDuck 得益于以下开源软件和资源

# Settings.About.LearnMore.Acknowledgements
source: Acknowledgments
ru_ru: Благодарности
vi_vn: Ghi nhận đóng góp
zh_hans: 致谢

# Optimizer.Performance
source: Performance
ru_ru: Производительность
vi_vn: Hiệu suất
zh_hans: 性能优化

# Optimizer.PowerManagement
source: Power Management
ru_ru: Управление питанием
vi_vn: Quản lý điện năng
zh_hans: 电源管理

# Optimizer.SecurityAndPrivacy
source: Security & Privacy
ru_ru: Безопасность и конфиденциальность
vi_vn: Bảo mật & Quyền riêng tư
zh_hans: 安全与隐私

# Optimizer.BloatwareAndServices
source: Bloatware & Services
ru_ru: Раз bloatware и службы
vi_vn: Bloatware & Dịch vụ
zh_hans: 精简与服务

# Optimizer.Gpu
source: GPU
ru_ru: Графический процессор
zh_hans: 图形处理器

# Optimizer.UserExperience
source: User Experience
ru_ru: Пользовательский опыт
vi_vn: Trải nghiệm người dùng
zh_hans: 用户体验

# Optimizer.UI.Risk.Safe
source: Safe
ru_ru: Безопасно
vi_vn: An toàn
zh_hans: 安全

# Optimizer.UI.Risk.Moderate
source: Moderate
ru_ru: Осторожно
vi_vn: Cẩn thận
zh_hans: 谨慎

# Optimizer.UI.Risk.Risky
source: Risky
ru_ru: Рискованно
vi_vn: Nguy hiểm
zh_hans: 高风险

# Optimizer.UI.Risk.Help
source: This value reflects the level of intervention and the safety of the optimization process. Please exercise caution and consider carefully before applying any optimization.
ru_ru: Это значение отражает уровень вмешательства и безопасность процесса оптимизации. Пожалуйста, внимательно рассмотрите перед применением любой оптимизации.
vi_vn: Giá trị này thể hiện mức độ can thiệp và mức độ an toàn của quá trình tối ưu hóa. Vui lòng thận trọng và xem xét kỹ lưỡng trước khi áp dụng bất kỳ tối ưu nào.
zh_hans: 该数值反映优化过程的干预程度和安全等级。请在应用任何优化前谨慎考虑。

# Optimizer.UI.Tags.System
source: System
ru_ru: Система
vi_vn: Hệ thống
zh_hans: 系统

# Optimizer.UI.Tags.Ram
source: Ram
ru_ru: Память
zh_hans: 内存

# Optimizer.UI.Tags.Disk
source: Disk
ru_ru: Диск
vi_vn: Ổ cứng
zh_hans: 磁盘

# Optimizer.UI.Tags.Network
source: Network
ru_ru: Сеть
vi_vn: Mạng
zh_hans: 网络

# Optimizer.UI.Tags.NetworkRequired
source: Network connection required
ru_ru: Требуется подключение к сети
vi_vn: Cần kết nối mạng
zh_hans: 需要网络连接

# Optimizer.UI.Tags.Privacy
source: Privacy
ru_ru: Конфиденциальность
vi_vn: Quyền riêng tư
zh_hans: 隐私

# Optimizer.UI.Tags.Security
source: Security
ru_ru: Безопасность
vi_vn: Bảo mật
zh_hans: 安全

# Optimizer.UI.Tags.Performance
source: Performance
ru_ru: Производительность
vi_vn: Hiệu suất
zh_hans: 性能

# Optimizer.UI.Tags.Latency
source: Latency
ru_ru: Задержка
vi_vn: Độ trễ
zh_hans: 延迟

# Optimizer.UI.Tags.Power
source: Power
ru_ru: Питание
vi_vn: Công suất/Điện năng
zh_hans: 电源

# Optimizer.UI.Tags.Audio
source: Audio
ru_ru: Аудио
vi_vn: Âm thanh
zh_hans: 音频

# Optimizer.UI.Tags.Display
source: Display
ru_ru: Дисплей
vi_vn: Màn hình
zh_hans: 显示

# Optimizer.UI.Tags.Visual
source: Visual
ru_ru: Визуальные эффекты
vi_vn: Giao diện
zh_hans: 视觉效果

# Optimizer.UI.Tags.Help
source: These tags indicate which parts of the system the optimization will affect.
ru_ru: Эти теги указывают, какие части системы затронет оптимизация
vi_vn: Các thẻ này cho biết tối ưu sẽ ảnh hưởng đến phần nào trong hệ thống.
zh_hans: 这些标签指示优化将影响系统的哪些部分

# Optimizer.Performance.DisableBackgroundApps.Name
source: Disable Background App Activity
ru_ru: Отключить фоновую активность приложений
vi_vn: Vô hiệu hóa ứng dụng nền
zh_hans: 禁用后台应用

# Optimizer.Performance.DisableBackgroundApps.ShortDescription
source: Prevents UWP apps from running background tasks, reducing memory pressure and CPU usage during idle periods.
ru_ru: Предотвращает выполнение фоновых задач UWP-приложениями, снижая нагрузку на память и CPU в периоды простоя
vi_vn: Ngăn các ứng dụng chạy ngầm khi không sử dụng để giải phóng RAM và giảm tải cho CPU.
zh_hans: 禁止非活动应用程序在后台运行，释放内存并降低 CPU 占用。

# Optimizer.Performance.SvcHostSplit.Name
source: Enable Service Host Splitting
ru_ru: Включить разделение Service Host
vi_vn: Tối ưu hóa cô lập dịch vụ
zh_hans: 优化服务隔离

# Optimizer.Performance.SvcHostSplit.ShortDescription
source: Sets the Service Host split threshold to match total system RAM, forcing Windows to isolate services into separate processes for improved stability.
ru_ru: Устанавливает порог разделения Service Host равным общему объёму системной памяти, принудительно изолируя службы в отдельные процессы для повышения стабильности
vi_vn: Chia nhỏ các dịch vụ hệ thống thành các tiến trình riêng biệt để tăng đáng kể độ ổn định.
zh_hans: 将系统服务拆分为独立进程，显著提升 Windows 的稳定性。

# Optimizer.Performance.SvcHostSplit.Error.InvalidRAM
source: Invalid RAM: {0}
ru_ru: Недействительный объём памяти: {0}
vi_vn: RAM không hợp lệ: {0}
zh_hans: 无效的内存容量：{0}

# Optimizer.Performance.ProcessPriority.Name
source: Enable Foreground Boost
ru_ru: Включить повышение приоритета foreground
vi_vn: Ưu tiên ứng dụng đang dùng
zh_hans: 优先处理活动应用

# Optimizer.Performance.ProcessPriority.ShortDescription
source: Configures Win32PrioritySeparation to 38 (Short, Variable, High foreground boost), prioritizing active applications and reducing input latency.
ru_ru: Настраивает Win32PrioritySeparation на 38 (короткий переменный квант, высокое повышение foreground), приоритизируя активные приложения и снижая задержку ввода
vi_vn: Cấu hình Win32PrioritySeparation thành 38 (Short, Variable, High foreground boost), ưu tiên ứng dụng đang hoạt động và giảm độ trễ đầu vào.
zh_hans: 为您当前使用的应用程序分配更多 CPU 资源，提供更快速的响应体验。

# Optimizer.Performance.GameTaskScheduling.Name
source: Enable Game Task Priority
ru_ru: Включить приоритет игровых задач
vi_vn: Tối ưu hóa lập lịch trò chơi
zh_hans: 优化游戏调度

# Optimizer.Performance.GameTaskScheduling.ShortDescription
source: Configures MMCSS "Games" task profile with High scheduling category and elevated GPU/IO priority for consistent frame pacing.
ru_ru: Настраивает профиль задач MMCSS "Games" на категорию High с повышенным GPU/IO приоритетом для стабильного кадрового pacing
vi_vn: Cấu hình hồ sơ tác vụ MMCSS "Games" với danh mục lập lịch High và mức ưu tiên GPU/IO cao để đảm bảo frame pacing ổn định.
zh_hans: 为游戏负载分配高优先级，确保帧率（FPS）稳定，游戏运行更顺滑。

# Optimizer.Performance.MultimediaResponsiveness.Name
source: Optimize MMCSS Responsiveness
ru_ru: Оптимизировать отзывчивость MMCSS
vi_vn: Tối ưu hóa phản hồi đa phương tiện
zh_hans: 优化多媒体响应

# Optimizer.Performance.MultimediaResponsiveness.ShortDescription
source: Minimizes MMCSS latency by setting SystemResponsiveness to 10 and disabling network throttling (0xFFFFFFFF) for real-time workloads.
ru_ru: Минимизирует задержку MMCSS, устанавливая SystemResponsiveness в 10 и отключая сетевое регулирование (0xFFFFFFFF) для real-time нагрузок
vi_vn: Giảm thiểu độ trễ MMCSS bằng cách đặt SystemResponsiveness thành 10 và vô hiệu hóa điều tiết mạng (0xFFFFFFFF) cho các tác vụ thời gian thực.
zh_hans: 降低音频、视频和网络任务的延迟，改善实时媒体和游戏表现。

# Optimizer.Performance.DisableGameBar.Name
source: Disable Xbox Game Bar
ru_ru: Отключить Xbox Game Bar
vi_vn: Tắt Xbox Game Bar
zh_hans: 禁用 Xbox 游戏栏

# Optimizer.Performance.DisableGameBar.ShortDescription
source: Disables Xbox Game Bar overlays, startup tips, and hotkey integration to eliminate background capture overhead.
ru_ru: Отключает оверлеи Xbox Game Bar, стартовые подсказки и интеграцию горячих клавиш, устраняя накладные расходы фонового захвата
vi_vn: Vô hiệu hóa lớp phủ Xbox Game Bar, thông báo khởi động và tích hợp phím tắt để loại bỏ chi phí xử lý nền từ tính năng ghi hình.
zh_hans: 禁用 Xbox 游戏栏覆盖层和后台功能，在游戏时节省系统资源。

# Optimizer.Performance.EnableGameMode.Name
source: Enable Game Mode
ru_ru: Включить игровой режим
vi_vn: Kích hoạt Chế độ trò chơi
zh_hans: 启用游戏模式

# Optimizer.Performance.EnableGameMode.ShortDescription
source: Activates Windows Game Mode via registry to automatically prioritize game processes and suppress Windows Update notifications during gameplay.
ru_ru: Активирует игровой режим Windows через реестр для автоматической приоритизации игровых процессов и подавления уведомлений Windows Update во время игры
vi_vn: Bật Game Mode để ưu tiên game và tạm hoãn các hoạt động gây gián đoạn của Windows Update.
zh_hans: 启用 Windows 游戏模式以优先处理游戏进程，并防止 Windows 更新的中断。

# Optimizer.Performance.DisableGameDVR.Name
source: Disable Game DVR Recording
ru_ru: Отключить запись Game DVR
vi_vn: Vô hiệu hóa ghi hình nền
zh_hans: 禁用后台录制

# Optimizer.Performance.DisableGameDVR.ShortDescription
source: Completely disables Game DVR background recording (AppCaptureEnabled, GameDVR_Enabled, AllowGameDVR policies) to eliminate capture overhead.
ru_ru: Полностью отключает фоновую запись Game DVR (AppCaptureEnabled, GameDVR_Enabled, политики AllowGameDVR), устраняя накладные расходы захвата
vi_vn: Tắt tính năng tự động ghi hình game chạy ngầm (DVR) để thu hồi hiệu năng bị chiếm dụng.
zh_hans: 关闭自动后台游戏录制 (DVR)，找回损失的性能和磁盘带宽。

# Optimizer.Performance.DisableMouseAcceleration.Name
source: Disable Mouse Acceleration
ru_ru: Отключить акселерацию мыши
vi_vn: Loại bỏ gia tốc chuột
zh_hans: 禁用鼠标加速

# Optimizer.Performance.DisableMouseAcceleration.ShortDescription
source: Sets MouseSpeed to 0 and clears acceleration thresholds, providing 1:1 physical-to-screen cursor movement for precise gaming.
ru_ru: Устанавливает MouseSpeed в 0 и сбрасывает пороги акселерации, обеспечивая соответствие 1:1 физического перемещения и движения курсора для точного игрового управления
vi_vn: Vô hiệu hóa việc tự động tăng tốc chuột của Windows, mang lại cảm giác di chuột chính xác 1:1.
zh_hans: 禁用 Windows 自动鼠标速度调整，提供精确的 1:1 光标移动。

# Optimizer.Performance.KeyboardLatencyOptimization.Name
source: Optimize Keyboard Responsiveness
ru_ru: Оптимизировать отзывчивость клавиатуры
vi_vn: Tối ưu hóa độ trễ bàn phím
zh_hans: 优化键盘响应

# Optimizer.Performance.KeyboardLatencyOptimization.ShortDescription
source: Minimizes keyboard delay (0) and maximizes repeat rate (31), disables StickyKeys/FilterKeys accessibility delays for rapid input.
ru_ru: Минимизирует задержку клавиатуры (0) и максимизирует скорость повтора (31), отключает задержки специальных возможностей StickyKeys/FilterKeys для быстрого ввода
vi_vn: Giảm thời gian chờ và tăng tốc độ phản hồi phím nhấn, giúp thao tác gõ phím nhanh và nhạy hơn.
zh_hans: 降低键盘输入延迟并提高重复速率，使打字和游戏响应更迅速。

# Optimizer.PowerManagement.DisableHibernate.Name
source: Disable Hibernate & Fast Startup
ru_ru: Отключить гибернацию и быстрый запуск
vi_vn: Vô hiệu hóa Chế độ ngủ đông
zh_hans: 禁用休眠与快速启动

# Optimizer.PowerManagement.DisableHibernate.ShortDescription
source: Disables Hibernate (HibernateEnabled=0) and Fast Startup (HiberbootEnabled=0), removes hiberfile.sys to reclaim disk space.
ru_ru: Отключает гибернацию (HibernateEnabled=0) и быстрый запуск (HiberbootEnabled=0), удаляет hiberfile.sys для освобождения дискового пространства
vi_vn: Tắt tính năng Hibernate và Fast Startup để giải phóng bộ nhớ ổ cứng và khởi động máy sạch hơn.
zh_hans: 关闭休眠和快速启动以回收数 GB 磁盘空间，并确保系统完全启动。

# Optimizer.PowerManagement.DisableUSBPowerSaving.Name
source: Disable USB Power Saving
ru_ru: Отключить энергосбережение USB
vi_vn: Ngăn ngắt nguồn cổng USB
zh_hans: 禁止 USB 自动断电

# Optimizer.PowerManagement.DisableUSBPowerSaving.ShortDescription
source: Disables USB selective suspend on all root hubs via MSPower_DeviceEnable WMI to prevent input device latency. Increases laptop power draw.
ru_ru: Отключает выборочное приостановление USB на всех корневых хабах через WMI MSPower_DeviceEnable, предотвращая задержку устройств ввода. Увеличивает энергопотребление ноутбука
vi_vn: Ngăn Windows tự động ngắt điện các cổng USB khi không dùng, tránh độ trễ cho chuột và bàn phím.
zh_hans: 防止 Windows 关闭 USB 端口供电，消除鼠标、键盘等外设的唤醒延迟。

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Name
source: Install optimizerDuck's Power Plan
ru_ru: Установить план питания optimizerDuck
vi_vn: Cài đặt Sơ đồ năng lượng tối ưu
zh_hans: 应用优化电源计划

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.ShortDescription
source: Downloads, imports, and activates the optimizerDuck power plan to prioritize maximum performance. May increase power use, heat, and fan noise.
ru_ru: Загружает, импортирует и активирует план питания optimizerDuck для максимальной производительности. Может увеличить энергопотребление, нагрев и шум вентиляторов
vi_vn: Kích hoạt sơ đồ năng lượng đặc biệt giúp máy luôn đạt hiệu năng cao nhất. (Có thể làm tăng nhiệt độ).
zh_hans: 安装自定义的性能优先电源计划，确保您的系统始终以最高速度运行。

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Progress.Downloading
source: Downloading power plan...
ru_ru: Загрузка плана питания...
vi_vn: Đang tải power plan...
zh_hans: 正在下载电源计划...

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Progress.Importing
source: Importing and activating power plan...
ru_ru: Импорт и активация плана питания...
vi_vn: Đang import và set active power plan...
zh_hans: 正在导入并激活电源计划...

source: Failed to detect the current active power plan.
ru_ru: Не удалось определить активный план питания
vi_vn: Không thể phát hiện power plan đang hoạt động hiện tại.
zh_hans: 无法检测当前活动的电源计划

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Error.DownloadFailed
source: Failed to download optimizerDuck's power plan.
ru_ru: Ошибка загрузки плана питания optimizerDuck
vi_vn: Không thể tải xuống power plan của optimizerDuck.
zh_hans: 下载 optimizerDuck 电源计划失败

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Error.ImportFailed
source: Failed to import optimizerDuck's power plan.
ru_ru: Ошибка импорта плана питания optimizerDuck
vi_vn: Không thể nhập power plan của optimizerDuck.
zh_hans: 导入 optimizerDuck 电源计划失败

# Optimizer.PowerManagement.InstallOptimizerDuckPowerPlan.Error.ActivateFailed
source: Failed to activate optimizerDuck's power plan.
ru_ru: Ошибка активации плана питания optimizerDuck
vi_vn: Không thể kích hoạt power plan của optimizerDuck.
zh_hans: 激活 optimizerDuck 电源计划失败

# Optimizer.PowerManagement.DisablePowerSaving.Name
source: Disable Power Throttling
ru_ru: Отключить регулирование питания
vi_vn: Vô hiệu hóa giới hạn năng lượng
zh_hans: 禁用系统电源节流

# Optimizer.PowerManagement.DisablePowerSaving.ShortDescription
source: Disables CPU power throttling (PowerThrottlingOff=1), forces multimedia system profile to AlwaysOn, disables USB surprise removal recovery.
ru_ru: Отключает регулирование питания CPU (PowerThrottlingOff=1), принудительно устанавливает профиль мультимедиа в AlwaysOn, отключает восстановление при неожиданном отключении USB
vi_vn: Ngăn Windows tự động giảm hiệu năng CPU (Power Throttling) để duy trì sức mạnh tối đa cho hệ thống.
zh_hans: 防止 Windows 限制 CPU 性能（电源节流），为活动任务维持峰值动力。

# Optimizer.SecurityAndPrivacy.DisableUAC.Name
source: Disable UAC Prompts
ru_ru: Отключить запросы UAC
vi_vn: Vô hiệu hóa xác nhận Admin (UAC)
zh_hans: 禁用管理员权限提示 (UAC)

# Optimizer.SecurityAndPrivacy.DisableUAC.ShortDescription
source: Sets EnableLUA=0 to disable User Account Control elevation prompts, allowing silent admin execution. Significantly reduces system security.
ru_ru: Устанавливает EnableLUA=0 для отключения запросов повышения прав UAC, разрешая тихое выполнение с правами администратора. Значительно снижает безопасность системы
vi_vn: Tắt các hộp thoại yêu cầu xác nhận khi mở ứng dụng với quyền Admin. Lưu ý: Làm giảm bảo mật.
zh_hans: 关闭以管理员身份运行应用时请求确认的用户账户控制 (UAC) 窗口。
