Repository: itsfatduck/optimizerDuck
Catalog: optimizerDuck/Resources/Languages/Translations.*.resx
Languages: ru_ru, vi_vn, zh_hans

# Optimizer.SecurityAndPrivacy.DisableTelemetry.Name
source: Reduce Telemetry & Feedback
ru_ru: Сократить телеметрию и отзывы
vi_vn: Vô hiệu hóa thu thập dữ liệu (Telemetry)
zh_hans: 禁用数据采集 (遥测)

# Optimizer.SecurityAndPrivacy.DisableTelemetry.ShortDescription
source: Applies comprehensive anti-telemetry policies: disables DiagTrack, dmwappushservice, WerSvc services; disables 14+ telemetry scheduled tasks; blocks 50+ telemetry registry keys including AllowTelemetry, AdvertisingInfo, Location tracking.
ru_ru: Применяет комплексные антителеметричные политики: отключает службы DiagTrack, dmwappushservice, WerSvc; отключает 14+ телеметричных плановых задач; блокирует 50+ телеметричных ключей реестра включая AllowTelemetry, AdvertisingInfo, отслеживание местоположения
vi_vn: Tắt các dịch vụ theo dõi và gửi báo cáo sử dụng của Windows về Microsoft, giúp bảo vệ quyền riêng tư cá nhân.
zh_hans: 禁用 Windows 遥测和使用情况追踪服务，增强个人隐私并减少后台活动。

# Optimizer.SecurityAndPrivacy.DisableTelemetry.Progress.EditRegistry
source: Applying policy and registry changes...
ru_ru: Применение политик и изменений реестра...
vi_vn: Đang áp dụng các chính sách và registry...
zh_hans: 正在应用策略和注册表更改...

# Optimizer.SecurityAndPrivacy.DisableTelemetry.Progress.DisableServices
source: Disabling telemetry services...
ru_ru: Отключение телеметричных служб...
vi_vn: Đang tắt các dịch vụ telemetry...
zh_hans: 正在禁用遥测服务...

# Optimizer.SecurityAndPrivacy.DisableTelemetry.Progress.DisableTasks
source: Disabling scheduled telemetry tasks...
ru_ru: Отключение плановых телеметричных задач...
vi_vn: Đang tắt các tác vụ telemetry theo lịch trình…
zh_hans: 正在禁用遥测计划任务...

# Optimizer.SecurityAndPrivacy.DisableAutoLogger.Name
source: Disable WMI AutoLogger
ru_ru: Отключить WMI AutoLogger
vi_vn: Vô hiệu hóa nhật ký hệ thống
zh_hans: 禁用系统日志记录

# Optimizer.SecurityAndPrivacy.DisableAutoLogger.ShortDescription
source: Stops 12 WMI AutoLogger sessions (Diagtrack-Listener, SQMLogger, WdiContextLog, etc.) by setting Start=0, reducing kernel-level event collection.
ru_ru: Останавливает 12 сессий WMI AutoLogger (Diagtrack-Listener, SQMLogger, WdiContextLog и др.), устанавливая Start=0, снижая сбор событий на уровне ядра
vi_vn: Ngăn việc ghi lại các nhật ký chẩn đoán chạy ngầm không cần thiết để tiết kiệm tài nguyên CPU/Ổ cứng.
zh_hans: 停止非必要的系统事件日志记录，减少持续的磁盘活动并节省 CPU 资源。

# Optimizer.SecurityAndPrivacy.DisableCortana.Name
source: Disable Cortana & Web Search
ru_ru: Отключить Cortana и веб-поиск
vi_vn: Vô hiệu hóa Cortana & Tìm kiếm
zh_hans: 禁用 Cortana 与网络搜索

# Optimizer.SecurityAndPrivacy.DisableCortana.ShortDescription
source: Blocks Cortana via AllowCortana=0, AllowCloudSearch=0 policies and disables web search integration in Windows Search.
ru_ru: Блокирует Cortana через политики AllowCortana=0, AllowCloudSearch=0 и отключает интеграцию веб-поиска в Windows Search
vi_vn: Tắt trợ lý ảo Cortana và ngăn Windows Search tìm kiếm trực tuyến để có kết quả nhanh hơn.
zh_hans: 关闭 Cortana 语音助手，并从 Windows 搜索栏中移除 Bing 网络搜索结果。

# Optimizer.SecurityAndPrivacy.DisableCopilot.Name
source: Disable Windows Copilot
ru_ru: Отключить Windows Copilot
vi_vn: Vô hiệu hóa Windows Copilot
zh_hans: 禁用 Windows Copilot

# Optimizer.SecurityAndPrivacy.DisableCopilot.ShortDescription
source: Applies TurnOffWindowsCopilot=1 policies, hides Copilot button from taskbar, blocks shell extension {CB3B0003-8088-4EDE-8769-8B354AB2FF8C}.
ru_ru: Применяет политики TurnOffWindowsCopilot=1, скрывает кнопку Copilot с панели задач, блокирует shell-расширение {CB3B0003-8088-4EDE-8769-8B354AB2FF8C}
vi_vn: Gỡ bỏ trợ lý AI Copilot khỏi thanh tác vụ và hệ thống để tiết kiệm dung lượng RAM.
zh_hans: 从任务栏和系统组件中移除 AI 助手 Copilot，释放内存和屏幕空间。

# Optimizer.SecurityAndPrivacy.DisableContentDeliveryManager.Name
source: Disable Content Delivery
ru_ru: Отключить доставку контента
vi_vn: Vô hiệu hóa quảng cáo & gợi ý
zh_hans: 禁用广告与推荐

# Optimizer.SecurityAndPrivacy.DisableContentDeliveryManager.ShortDescription
source: Disables Content Delivery Manager (ContentDeliveryAllowed=0, SubscribedContent-*=0), stopping suggested apps, tips, and promotional content in Settings/Start.
ru_ru: Отключает Content Delivery Manager (ContentDeliveryAllowed=0, SubscribedContent-*=0), останавливая рекомендуемые приложения, подсказки и промо-контент в Параметрах/Пуске
vi_vn: Chặn Windows tự động cài đặt ứng dụng quảng cáo và gợi ý nội dung trên màn hình Start.
zh_hans: 阻止 Windows 自动安装推广应用，并停止在开始菜单中显示建议内容。

# Optimizer.BloatwareAndServices.DisablePreinstalledApps.Name
source: Block Preinstalled Apps
ru_ru: Блокировать предустановленные приложения
vi_vn: Chặn ứng dụng rác cài sẵn
zh_hans: 阻止预装流氓软件

# Optimizer.BloatwareAndServices.DisablePreinstalledApps.ShortDescription
source: Sets PreInstalledAppsEnabled=0, OemPreInstalledAppsEnabled=0, SilentInstalledAppsEnabled=0 to prevent automatic installation of OEM bloatware and promoted apps.
ru_ru: Устанавливает PreInstalledAppsEnabled=0, OemPreInstalledAppsEnabled=0, SilentInstalledAppsEnabled=0 для предотвращения автоматической установки OEM-предустановленного ПО и промо-приложений
vi_vn: Chặn Windows tự động cài app OEM/bundled và “suggested apps”, giúp máy sạch bloatware hơn (đặc biệt sau cài mới/reset).
zh_hans: 防止 Windows 自动重新安装不需要的第三方应用和预装推广软件。

# Optimizer.BloatwareAndServices.ConfigureServices.Name
source: Optimize Service Startup
ru_ru: Оптимизировать запуск служб
vi_vn: Tối ưu hóa các dịch vụ hệ thống
zh_hans: 优化系统服务启动

# Optimizer.BloatwareAndServices.ConfigureServices.ShortDescription
source: Configures 100+ Windows services startup types: disables telemetry services (DiagTrack, DcpSvc), sets non-critical services to Manual, keeps essential services (Audio, Networking, Security) as Automatic. Reduces background RAM/CPU usage.
ru_ru: Настраивает типы запуска 100+ служб Windows: отключает телеметричные службы (DiagTrack, DcpSvc), устанавливает некритичные службы вручную, сохраняет необходимые (аудио, сеть, безопасность) как автоматические. Снижает фоновое использование RAM/CPU
vi_vn: Điều chỉnh các dịch vụ chạy ngầm để giải phóng tài nguyên mà vẫn đảm bảo tính năng cần thiết.
zh_hans: 调整非必要的后台服务，在保留 Windows 核心功能的同时释放系统资源。

source: Setting startup type for {0} to {1}...
ru_ru: Установка типа запуска для {0} в {1}...
vi_vn: Đang đặt kiểu khởi động cho dịch vụ {0} thành {1}...
zh_hans: 正在将 {0} 的启动类型设置为 {1}...

# Optimizer.Gpu.AmdDisableUlps.Name
source: Disable AMD ULPS
ru_ru: Отключить AMD ULPS
vi_vn: Vô hiệu hóa AMD ULPS
zh_hans: 禁用 AMD ULPS

# Optimizer.Gpu.AmdDisableUlps.ShortDescription
source: Sets EnableULPS=0 in AMD GPU registry to prevent Ultra Low Power State wake-up delays and multi-monitor issues. Reduces power saving on idle.
ru_ru: Устанавливает EnableULPS=0 в реестре GPU AMD для предотвращения задержек пробуждения из состояния Ultra Low Power State и проблем с несколькими мониторами. Снижает энергосбережение в простое
vi_vn: Tắt chế độ siêu tiết kiệm điện của AMD để tránh hiện tượng GPU bị khựng hoặc trễ khi thức dậy.
zh_hans: 关闭 AMD 的超低功耗模式，消除唤醒时的 GPU 卡顿或延迟。

# Optimizer.Gpu.AmdDisablePowerGating.Name
source: Disable AMD Power Gating
ru_ru: Отключить управление питанием AMD
vi_vn: Tắt AMD Power Gating
zh_hans: 禁用 AMD 电源门控

# Optimizer.Gpu.AmdDisablePowerGating.ShortDescription
source: Sets DisablePowerGating=1, PP_GPUPowerDownEnabled=0, DisableDynamicPstate=1 to prevent AMD GPU power state transitions. Maintains consistent clocks at cost of higher idle power.
ru_ru: Устанавливает DisablePowerGating=1, PP_GPUPowerDownEnabled=0, DisableDynamicPstate=1 для предотвращения переходов GPU AMD между состояниями питания. Поддерживает постоянные частоты за счёт более высокого энергопотребления в простое
vi_vn: Duy trì hiệu năng GPU ổn định bằng cách ngăn việc tự động ngắt nguồn các thành phần bên trong.
zh_hans: 通过防止自动断开内部组件供电，维持稳定的 GPU 性能。

# Optimizer.Gpu.AmdDisableVideoClockGating.Name
source: Disable AMD Video Clock Gating
ru_ru: Отключить тактовое управление видео AMD
vi_vn: Tắt AMD Video Clock Gating
zh_hans: 禁用 AMD 视频时钟门控

# Optimizer.Gpu.AmdDisableVideoClockGating.ShortDescription
source: Sets DisableVCEPowerGating=1, DisableVceClockGating=1, EnableUvdClockGating=0 for AMD video engines (VCE/UVD) to improve encode/decode stability. Increases video playback power.
ru_ru: Устанавливает DisableVCEPowerGating=1, DisableVceClockGating=1, EnableUvdClockGating=0 для видеодвижков AMD (VCE/UVD), повышая стабильность кодирования/декодирования. Увеличивает энергопотребление при воспроизведении видео
vi_vn: Tăng cường độ ổn định cho quá trình xử lý video bằng cách giữ xung nhịp engine video luôn sẵn sàng.
zh_hans: 通过保持视频引擎频率就绪，增强视频处理的稳定性。

# Optimizer.Gpu.AmdDisableAspm.Name
source: Disable AMD ASPM
ru_ru: Отключить AMD ASPM
vi_vn: Vô hiệu hóa AMD ASPM
zh_hans: 禁用 AMD ASPM

# Optimizer.Gpu.AmdDisableAspm.ShortDescription
source: Sets EnableAspmL0s=0, EnableAspmL1=0 to disable Active State Power Management on AMD GPUs, reducing PCIe bus latency. Increases slot power consumption.
ru_ru: Устанавливает EnableAspmL0s=0, EnableAspmL1=0 для отключения Active State Power Management на GPU AMD, снижая задержку шины PCIe. Увеличивает энергопотребление слота
vi_vn: Giảm độ trễ giao tiếp PCIe cho card đồ họa AMD, giúp tăng tốc độ phản hồi.
zh_hans: 降低 AMD 显卡的 PCIe 通信延迟，提升响应速度。

# Optimizer.Gpu.NvidiaDisableDynamicPstate.Name
source: Disable NVIDIA Dynamic P-State
ru_ru: Отключить динамические P-State NVIDIA
vi_vn: Khóa trạng thái năng lượng NVIDIA
zh_hans: 锁定 NVIDIA 电源状态

# Optimizer.Gpu.NvidiaDisableDynamicPstate.ShortDescription
source: Sets DisableDynamicPstate=1 to lock NVIDIA GPU into fixed performance state, preventing clock speed fluctuations. Increases idle power draw.
ru_ru: Устанавливает DisableDynamicPstate=1 для фиксации GPU NVIDIA в состоянии постоянной производительности, предотвращая колебания частот. Увеличивает энергопотребление в простое
vi_vn: Ngăn NVIDIA GPU tự động thay đổi mức năng lượng để duy trì mức hiệu năng nhất quán nhất.
zh_hans: 防止 NVIDIA GPU 自动更改能级，以维持最一致的性能表现。

# Optimizer.Gpu.NvidiaDisableAsyncPstates.Name
source: Disable NVIDIA Async P-States
ru_ru: Отключить асинхронные P-State NVIDIA
vi_vn: Vô hiệu hóa Async P-States
zh_hans: 禁用异步 P-States

# Optimizer.Gpu.NvidiaDisableAsyncPstates.ShortDescription
source: Sets DisableASyncPstates=1 to prevent NVIDIA asynchronous power state switching, providing deterministic performance for VR/real-time apps.
ru_ru: Устанавливает DisableASyncPstates=1 для предотвращения асинхронного переключения состояний питания NVIDIA, обеспечивая детерминированную производительность для VR/real-time приложений
vi_vn: Tắt việc chuyển đổi trạng thái hiệu năng không đồng bộ để đạt được sự ổn định cao nhất.
zh_hans: 关闭异步能效状态切换，以获得极致的稳定性。

# Optimizer.Gpu.IntelDisableAsyncFlips.Name
source: Disable Intel Async Flips
ru_ru: Отключить асинхронные переключения Intel
vi_vn: Bật đồng bộ hình ảnh Intel
zh_hans: 启用 Intel 图像同步

# Optimizer.Gpu.IntelDisableAsyncFlips.ShortDescription
source: Sets Display1_DisableAsyncFlips=1 to force synchronous buffer flips on Intel iGPU, reducing input-to-display latency and screen tearing.
ru_ru: Устанавливает Display1_DisableAsyncFlips=1 для принудительного синхронного переключения буферов на Intel iGPU, снижая задержку от ввода до отображения и уменьшая разрывы кадров
vi_vn: Sử dụng cơ chế làm mới khung hình đồng bộ để giảm độ trễ hiển thị và hạn chế xé hình.
zh_hans: 使用同步帧刷新机制降低显示延迟，并限制画面撕裂。

# Optimizer.Gpu.IntelDisableAdaptiveVsync.Name
source: Disable Intel Adaptive V-Sync
ru_ru: Отключить адаптивную вертикальную синхронизацию Intel
vi_vn: Vô hiệu hóa Adaptive V-Sync
zh_hans: 禁用自适应垂直同步

# Optimizer.Gpu.IntelDisableAdaptiveVsync.ShortDescription
source: Sets AdaptiveVsyncEnable=0 to disable Intel's adaptive V-Sync that dynamically adjusts to frame rate, using fixed V-Sync instead for stable timing.
ru_ru: Устанавливает AdaptiveVsyncEnable=0 для отключения адаптивной вертикальной синхронизации Intel, которая динамически регулируется под частоту кадров, используя фиксированную вертикальную синхронизацию для стабильного тайминга
vi_vn: Duy trì thời gian xuất khung hình ổn định bằng cách tắt tính năng V-Sync thích ứng của Intel.
zh_hans: 通过关闭 Intel 的自适应垂直同步功能，维持固定的帧生成时间。

# Optimizer.UserExperience.DisableTaskbarNewsAndInterests.Name
source: Disable Taskbar News & Interests
ru_ru: Отключить Новости и Интересы на панели задач
vi_vn: Tắt Tin tức & Sở thích
zh_hans: 禁用资讯和兴趣

# Optimizer.UserExperience.DisableTaskbarNewsAndInterests.ShortDescription
source: Sets AllowNewsAndInterests=0, EnableFeeds=0 to remove the News and Interests widget from taskbar, eliminating MSN feed background updates.
ru_ru: Устанавливает AllowNewsAndInterests=0, EnableFeeds=0 для удаления виджета Новости и Интересы с панели задач, устраняя фоновые обновления ленты MSN
vi_vn: Gỡ bỏ tiện ích tin tức trên thanh tác vụ để tập trung hơn và giảm tải cho hệ thống.
zh_hans: 从任务栏移除资讯组件，减少分心并减轻系统负担。

# Optimizer.UserExperience.DisableTaskbarExtraButtons.Name
source: Disable Extra Taskbar Buttons
ru_ru: Отключить дополнительные кнопки панели задач
vi_vn: Ẩn các nút không dùng trên Taskbar
zh_hans: 隐藏任务栏无用按钮

# Optimizer.UserExperience.DisableTaskbarExtraButtons.ShortDescription
source: Sets TaskbarDa=0 (Widgets), TaskbarMn=0 (Chat), ShowTaskViewButton=0 to hide taskbar buttons for a minimal interface.
ru_ru: Устанавливает TaskbarDa=0 (Виджеты), TaskbarMn=0 (Чат), ShowTaskViewButton=0 для скрытия кнопок панели задач, создавая минималистичный интерфейс
vi_vn: Dọn dẹp thanh tác vụ bằng cách ẩn các nút Widgets, Chat và Task View.
zh_hans: 隐藏小组件、聊天和任务视图按钮，使任务栏更整洁。

# Optimizer.UserExperience.DisableTaskbarSearchAndBing.Name
source: Disable Taskbar Search & Bing
ru_ru: Отключить поиск и Bing на панели задач
vi_vn: Tắt Tìm kiếm & Bing trên Taskbar
zh_hans: 禁用任务栏搜索和 Bing

# Optimizer.UserExperience.DisableTaskbarSearchAndBing.ShortDescription
source: Sets SearchboxTaskbarMode=0, BingSearchEnabled=0 to remove search box from taskbar and disable Bing web search in Start menu.
ru_ru: Устанавливает SearchboxTaskbarMode=0, BingSearchEnabled=0 для удаления поля поиска с панели задач и отключения веб-поиска Bing в меню Пуск
vi_vn: Gỡ bỏ hộp tìm kiếm và tắt kết quả từ Bing để thanh tác vụ và menu Start sạch sẽ hơn.
zh_hans: 移除搜索框并禁用 Bing 搜索结果，让任务栏和开始菜单更清爽。

# Optimizer.UserExperience.RemoveMeetNowAndPeople.Name
source: Remove Meet Now & People
ru_ru: Удалить Meet Now и Люди
vi_vn: Xóa Meet Now & People
zh_hans: 移除 Meet Now 与 People

# Optimizer.UserExperience.RemoveMeetNowAndPeople.ShortDescription
source: Sets HideSCAMeetNow=1, PeopleBand=0 to remove Meet Now (Skype) and People icons from taskbar notification area.
ru_ru: Устанавливает HideSCAMeetNow=1, PeopleBand=0 для удаления иконок Meet Now (Skype) и Люди из области уведомлений панели задач
vi_vn: Gỡ bỏ các biểu tượng Meet Now và People khỏi thanh hệ thống để giảm sự lộn xộn.
zh_hans: 从系统托盘中移除 Meet Now 和 People 图标，减少视觉干扰。

# Optimizer.UserExperience.EnableTaskbarEndTask.Name
source: Enable Taskbar End Task
ru_ru: Включить завершение задач на панели задач
vi_vn: Bật tính năng "Kết thúc tác vụ"
zh_hans: 启用“结束任务”功能

# Optimizer.UserExperience.EnableTaskbarEndTask.ShortDescription
source: Sets TaskbarEndTask=1 to add "End task" option to taskbar right-click menu, allowing quick process termination without Task Manager.
ru_ru: Устанавливает TaskbarEndTask=1 для добавления опции "Завершить задачу" в контекстное меню панели задач, позволяя быстро завершать процессы без Диспетчера задач
vi_vn: Cho phép nhanh chóng tắt ứng dụng bị treo ngay từ thanh tác vụ mà không cần mở Task Manager.
zh_hans: 允许直接从任务栏快速关闭无响应的应用，无需打开任务管理器。

# Optimizer.UserExperience.EnableDarkMode.Name
source: Enable Dark Mode
ru_ru: Включить тёмный режим
vi_vn: Kích hoạt Chế độ tối (Dark Mode)
zh_hans: 激活深色模式 (Dark Mode)

# Optimizer.UserExperience.EnableDarkMode.ShortDescription
source: Sets AppsUseLightTheme=0, SystemUsesLightTheme=0 to enable dark mode for system apps, Settings, and shell elements.
ru_ru: Устанавливает AppsUseLightTheme=0, SystemUsesLightTheme=0 для включения тёмного режима в системных приложениях, Параметрах и элементах оболочки
vi_vn: Chuyển hệ điều hành và ứng dụng sang giao diện tối giúp dịu mắt và tiết kiệm điện.
zh_hans: 将系统和应用切换至深色界面，以缓解眼部疲劳并节省能源。

# Optimizer.UserExperience.DisableExplorerAndSystemNotifications.Name
source: Disable Explorer & System Notifications
ru_ru: Отключить уведомления Проводника и системы
vi_vn: Vô hiệu hóa thông báo phiền hà
zh_hans: 禁用烦人的系统通知

# Optimizer.UserExperience.DisableExplorerAndSystemNotifications.ShortDescription
source: Sets ShowSyncProviderNotifications=0, SystemPaneSuggestionsEnabled=0, ToastEnabled=0 to disable OneDrive sync ads, Windows tips, and toast notifications.
ru_ru: Устанавливает ShowSyncProviderNotifications=0, SystemPaneSuggestionsEnabled=0, ToastEnabled=0 для отключения рекламы синхронизации OneDrive, подсказок Windows и всплывающих уведомлений
vi_vn: Chặn các thông báo quảng cáo, mẹo sử dụng và thông báo không cần thiết từ Windows.
zh_hans: 拦截来自 Windows 的广告、使用提示和其他非必要通知。

# Optimizer.UserExperience.ShowFileExtensionsAndHiddenFiles.Name
source: Show File Extensions & Hidden Files
ru_ru: Показывать расширения и скрытые файлы
vi_vn: Hiện đuôi tệp & tệp ẩn
zh_hans: 显示扩展名与隐藏文件

# Optimizer.UserExperience.ShowFileExtensionsAndHiddenFiles.ShortDescription
source: Sets HideFileExt=0, Hidden=1 in Explorer to display file extensions and reveal hidden/system files for transparency.
ru_ru: В Проводнике устанавливает HideFileExt=0, Hidden=1 для отображения расширений файлов и показа скрытых/системных файлов для прозрачности
vi_vn: Hiển thị đầy đủ phần mở rộng tệp và các tệp tin ẩn để thuận tiện cho việc quản lý hệ thống.
zh_hans: 始终显示文件扩展名和隐藏的系统文件，方便系统管理。

# Optimizer.UserExperience.EnableClassicContextMenu.Name
source: Enable Classic Context Menu (for Windows 11)
ru_ru: Включить классическое контекстное меню (Windows 11)
vi_vn: Sử dụng Menu chuột phải cổ điển
zh_hans: 使用经典右键菜单

# Optimizer.UserExperience.EnableClassicContextMenu.ShortDescription
source: Creates InprocServer32 key at CLSID {86ca1aa0-34aa-4e8b-a509-50c905bae2a2} to restore Windows 10-style full context menu on Windows 11.
ru_ru: Создаёт ключ InprocServer32 в CLSID {86ca1aa0-34aa-4e8b-a509-50c905bae2a2} для восстановления полного контекстного меню в стиле Windows 10 на Windows 11
vi_vn: Khôi phục menu chuột phải đầy đủ kiểu Windows 10 trên Windows 11.
zh_hans: 在 Windows 11 上恢复 Windows 10 风格的完整右键菜单。

# Optimizer.UserExperience.SpeedUpExplorerAndMenus.Name
source: Speed Up Explorer & Menus
ru_ru: Ускорить Проводник и меню
vi_vn: Tăng tốc Explorer & Menu
zh_hans: 加速资源管理器与菜单

# Optimizer.UserExperience.SpeedUpExplorerAndMenus.ShortDescription
source: Sets StartupDelayInMSec=0, MenuShowDelay=0 to eliminate Explorer startup delay and reduce menu hover delay to minimum.
ru_ru: Устанавливает StartupDelayInMSec=0, MenuShowDelay=0 для устранения задержки запуска Проводника и минимизации задержки при наведении на меню
vi_vn: Loại bỏ thời gian trễ khi mở thư mục và hiển thị menu để giao diện phản hồi tức thì.
zh_hans: 消除打开文件夹和显示菜单时的延迟，使界面响应瞬时化。

# Optimizer.UserExperience.ShowSecondsInSystemClock.Name
source: Show Seconds in System Clock
ru_ru: Показывать секунды в системных часах
vi_vn: Hiển thị giây trên đồng hồ
zh_hans: 时钟显示秒数

# Optimizer.UserExperience.ShowSecondsInSystemClock.ShortDescription
source: Sets ShowSecondsInSystemClock=1 to display seconds in taskbar clock for precise time monitoring.
ru_ru: Устанавливает ShowSecondsInSystemClock=1 для отображения секунд в часах на панели задач для точного мониторинга времени
vi_vn: Thêm hiển thị kim giây vào đồng hồ hệ thống trên thanh tác vụ để theo dõi giờ chính xác.
zh_hans: 在任务栏系统时钟中增加秒数显示，方便精确计时。

# Optimizer.UserExperience.DisableVisualEffects.Name
source: Disable Visual Effects
ru_ru: Отключить визуальные эффекты
vi_vn: Tắt hiệu ứng chuyển động
zh_hans: 禁用动画效果

# Optimizer.UserExperience.DisableVisualEffects.ShortDescription
source: Sets TaskbarAnimations=0, ListviewShadow=0, EnableTransparency=0, EnableAeroPeek=0 to disable animations, shadows, transparency for improved UI responsiveness.
ru_ru: Устанавливает TaskbarAnimations=0, ListviewShadow=0, EnableTransparency=0, EnableAeroPeek=0 для отключения анимаций, теней, прозрачности, повышая отзывчивость интерфейса
vi_vn: Vô hiệu hóa các hiệu ứng cửa sổ, bóng đổ và độ trong suốt để tăng tối đa tốc độ giao diện.
zh_hans: 关闭窗口动画、阴影和透明效果，以获得最极致的界面速度。

# OptimizationDetailsDialog.DetailedDescription
source: Detailed description
ru_ru: Подробное описание
vi_vn: Mô tả chi tiết
zh_hans: 详细描述

# OptimizationDetailsDialog.Tags
source: Tags
ru_ru: Теги
vi_vn: Thẻ
zh_hans: 标签

# OptimizationDetailsDialog.Other.OpenRevertFile.Title
source: Revert file
ru_ru: Файл отката
vi_vn: Tệp hoàn tác
zh_hans: 还原文件

# Optimization.Apply.Processing
source: Applying changes...
ru_ru: Применение изменений...
vi_vn: Đang áp dụng...
zh_hans: 正在应用更改...

# Optimization.Apply.Completed
source: Completed
ru_ru: Завершено
vi_vn: Hoàn tất
zh_hans: 已完成

# Optimization.Apply.Success
source: Successfully applied {0}.
ru_ru: Успешно применено {0}
vi_vn: Áp dụng {0} thành công.
zh_hans: 成功应用 {0}

# Optimization.Apply.Error.FailedWithSteps
source: Applied {0} with {1} failed step(s).
ru_ru: Применено {0}, но {1} шагов не удалось
vi_vn: Đã áp dụng {0} nhưng có {1} bước bị lỗi.
zh_hans: 已应用 {0}，但有 {1} 个步骤失败

# Optimization.Apply.Error.Failed
source: Failed to apply {0}.
ru_ru: Не удалось применить {0}
vi_vn: Không thể áp dụng {0}.
zh_hans: 应用 {0} 失败

# Optimization.Revert.Reverting
source: Reverting...
ru_ru: Откат изменений...
vi_vn: Đang hoàn tác...
zh_hans: 正在还原...

# Optimization.Revert.Success
source: Successfully reverted {0}!
ru_ru: Успешно отменено {0}!
vi_vn: Hoàn tác {0} thành công!
zh_hans: 成功还原 {0}！

# Optimization.Revert.Error.FailedWithSteps
source: Reverted {0} with {1} failed step(s).
ru_ru: Отменено {0}, но {1} шагов не удалось
vi_vn: Hoàn tác {0} nhưng có {1} bước thất bại.
zh_hans: 还原 {0}，但有 {1} 个步骤失败

# Optimization.Revert.Error.Failed
source: Failed to revert {0}.
ru_ru: Не удалось отменить {0}
vi_vn: Không thể hoàn tác {0}.
zh_hans: 还原 {0} 失败

# Optimization.Retry.Processing
source: Retrying failed steps...
ru_ru: Повторение неудавшихся шагов...
vi_vn: Đang thử lại các bước thất bại...
zh_hans: 正在重试失败的步骤...

# Optimization.RetryStep.Processing
source: Retrying {0} step ({1}/{2} steps)
ru_ru: Повторение шага {0} ({1}/{2} шагов)
vi_vn: Đang thử lại bước {0} ({1}/ {2} bước)
zh_hans: 正在重试第 {0} 步（共 {1}/{2} 步）

# Optimization.Revert.ExecutingStep
source: Executing revert step: {0}/{1} ({2})
ru_ru: Выполнение шага отката: {0}/{1} ({2})
vi_vn: Đang thực hiện bước hoàn tác: {0}/{1} ({2})
zh_hans: 正在执行还原步骤：{0}/{1} ({2})

# Revert.Error.InvalidData
source: Invalid revert data for {0}: {1}
ru_ru: Недействительные данные отката для {0}: {1}
vi_vn: Dữ liệu hoàn tác không hợp lệ cho {0}: {1}
zh_hans: {0} 的还原数据无效：{1}

# Revert.Error.NoDataFound
source: No revert data found for {0}.
ru_ru: Данные отката для {0} не найдены
vi_vn: Không tìm thấy dữ liệu hoàn tác cho {0}.
zh_hans: 未找到 {0} 的还原数据

# Revert.Error.RevertFailed
source: Failed to revert {0}: {1}
ru_ru: Не удалось отменить {0}: {1}
vi_vn: Không thể hoàn tác {0}: {1}
zh_hans: 还原 {0} 失败：{1}

# Revert.Error.FileNotFound
source: Revert file not found
ru_ru: Файл отката не найден
vi_vn: Không tìm thấy tệp hoàn tác
zh_hans: 未找到还原文件

# Revert.Error.FileEmpty
source: Revert file is empty
ru_ru: Файл отката пуст
vi_vn: Tệp hoàn tác trống
zh_hans: 还原文件为空

# Revert.Error.ReadFailed
source: Failed to read revert data: {0}
ru_ru: Ошибка чтения данных отката: {0}
vi_vn: Không thể đọc dữ liệu hoàn tác: {0}
zh_hans: 读取还原数据失败：{0}

# Revert.Error.InvalidJson
source: Invalid revert data
ru_ru: Недействительные данные отката
vi_vn: Dữ liệu hoàn tác không hợp lệ
zh_hans: 还原数据无效
